[
  {
    "storyText": "To love and to be loved\n Last year,I failed a clinical internship for my dream job when my persistent low mood and thoughts impacted my work performance.This was a final blow for me,following a series of other difficult life events within a few months.It felt like everything that could have gone wrong, did go wrong.\nI felt very lost.\nI didn' t know whom I could trust.I didn' t find my family supportive– I was constantly criticised for anything I did or said, and felt that I was to blame for everything that went wrong in my life.I was always second - guessing my perspectives and experiences, and cautious of voicing out any opinion that was different from theirs. The premature end of my internship on ' medical grounds' of my mental health only amplified the self - critical thoughts in my mind – that nothing I did was right or ever enough.\n I used to be a source of support and encouragement for my friends – the high - achieving social butterfly in university who seemed to have it altogether, until depression stole my relationships and physical health by feeding my mind lies about myself. I desperately wanted to disappear and pushed friends away, sometimes literally.I knew that my friends were hurt by my withdrawal and rejection of their hugs, but at the time I felt my actions were justified because I saw myself as a bad person that my friends didn' t deserve to have as part of their lives.\n It was a time when shame felt tangible, and I truly believed that I was a contamination to people's lives, no matter how much kindness and encouragement I tried to give.It was like I was bad and deserved to be punished or destroyed rather than be given a future and a second chance, so I made plans to end my life.\n The turning point came when I began opening up to people, accepting help and taking baby steps in trusting that not everyone has a hidden agenda to reject me.For me, trust is still a work in progress even up to today.\n Psychotherapy and antidepressants were helpful in starting my recovery and in recognising and navigating abusive relationships, but most of my recovery was made possible with the support of a small handful of amazing friends that I trust.\n They frequently went out of their way to look out for me, listened to me, pointed out triggers and nudged me to challenge unhelpful habits when I struggled with lapses.They embodied love that did not depend on what I did, and Christian friends would pray and read the Bible along with me.\n I used to live in fear – of opening up and of being myself, because it meant being hurt.But I began healing through relationships where I felt safe and was held accountable in non - judgmental ways.\n I found freedom from living in fear by getting to know God on a personal level.It is a connection built on a kind of love that is unconditional, and reflected in truths written in the Bible, and these have shaped how I see others and myself.\n I dream of being a person whom everyone will remember as someone who is trustworthy, whom they feel comfortable being themselves around.I hope to make a positive difference to other people' s lives, especially those who face disadvantages.\n The light shines in the darkness, and the darkness has not overcome it.You are a light for simply being you, even if you don' t feel worthy of being loved.You are made to be loved and to love others.There is so much you can bring to the world around you when you simply show up as yourself and open up.",
    "storyAuthor": "Daniel Peter"
  },
  {
    "storyText": "Darkness into Light\n Despite growing up in a family of 4 children, loneliness was an emotion that I often felt from a young age. My parents’ relationship was rocky as I grew up, and as the eldest of 4 children, I often felt the need to be strong for both my parents and my three younger siblings. In school, I struggled to forge close friendships with my peers due to some encounters with bullies that left me feeling excluded. When I did make friends, these friendships never lasted very long. Instead, I often felt like the single outsider within my group of friends. These incidents made me feel misunderstood, and I could not find anyone to turn to when I was struggling. The loneliness that I felt was exacerbated by my childhood struggle with trichotillomania, an obsessive-compulsive hair-pulling disorder that left me half-bald and too ashamed to face the world.\n As a result of these experiences, I began to internalise the lie that I was abandoned and all alone in the world, with nobody to depend on. I thought of myself as being the ‘common problem’ in all of my faded friendships, and began to subscribe the lie that I was worthless, and that people were better off without me. To save myself from being hurt by others, I began to close myself off from the world around me. However, in choosing to retreat and hide in my own darkness of self-condemnation and self-pity, I inevitably also shut God out from my life. God became a mere distant, apathetic figure in my life – yet another person that I could not truly depend on. This eventually led me down a spiral of depression, anxiety and suicidal thoughts as I lost sight of the value and purpose of my own life.\n By the grace of God, I said ‘yes’ to attending the School of Witness (SOW) 2018 after completing Junior College. Through sessions, prayer ministry, and 1-1 journeying in the school, I encountered God’s overwhelming and unceasing love for me for the very first time. I learnt how to reject the lies of abandonment and worthlessness that the evil one was trying to feed me, and instead came to encounter a God who always sees me and hears me, who loves me for all my brokenness and imperfections. I was encountering for the first time the perfect Father and perfect Lover, who had chosen to adopt me to be His child; a child of light. At one of the lowest points in my life, the grace of God pierced through the darkness that dominated my skies. My Father had never once abandoned me; instead, He moved mountains to save me. My encounter with Christ at the SOW opened my eyes to the deep and beautiful significance of my life, and softened my hardened heart to receive love not just from Him, but from the brothers and sisters in Christ He had surrounded me with. I had my first taste of the ‘fullness of life’ that Jesus offers, and my heart was set ablaze with a desire for more of Him.\n Little did I know it then, but SOW18 was just the beginning of a beautiful story that Jesus has been writing in my life. Over the past 3 years, Jesus has continuously challenged me to deepen my faith in Him, and increase my confidence in my identity as His child. Through the call to step into leadership in my university community, NTU Catholic Students Apostolate, I have learnt to purify my heart of the need to prove myself and earn my worth before the eyes of God. He reminds me that I do not need to earn His favour. He has been restoring my distorted image of God as a distant Father, by reminding me that even in my unfaithfulness and weakness, He sees me, hears me, and welcomes me as I am.\n Through the difficulties of university life, the Father has been my comfort and my solace; He slowly strips me of the fear of depending on anyone other than myself by proving time and again that He is a God who can be trusted to take care of me in all things, be it academics, relationships, family, or my future. By turning more and more to the Lord, I am prevented from spiralling down into a pit of self-pity and condemnation. Instead, I allow myself to be seen, heard, and comforted by the greatest Lover of my soul.\n In his letter to the Ephesians, St Paul writes “For once you were darkness, but now in the Lord you are light. Live as children of light,” (Eph 5:9). This is the exhortation that continues to challenge me to live for more, particularly when I am tempted to give up and remain in the familiar comfort of an aimless life of self-pity. While there are times where I still struggle to step out of the darkness and into light, I have a Father who will never abandon me. I am not alone. He is the One whom I can count on to chase me down, fight till I am found, and bring me home once more to Him. Brothers and sisters, we are not orphans; we are children of the most High. Will you join me in running to our Father to live in fullness and light?\n",
    "storyAuthor": "Caitlyn Ang"
  },
  {
    "storyText": "Life after New Life\n Five years ago, I was baptised into the Catholic Church at Church of Christ the King. Jesus picked me up during the darkest moment of my life and lovingly, He led me to a new life of hope, joy, peace and healing. Today, as I contemplate on Jesus’ love for me on this spiritual journey after my Baptism, I realise how He is working so evidently in my life\n Focus\n Not long after my Baptism, I encountered a great turmoil in my family, which overwhelmed me with fear. The incident brought about many uncertainties and challenges which seemed impossible for me to overcome. I saw myself in the image of Peter sinking into the water, when he felt the force of the wind and took fright.\n Realising that I was allowing fear to take control of my life, I consciously turned my eyes back to Jesus again.\n  immediately took a piece of paper and listed down all my fears on one side of it, and on the other, what Jesus has done for me personally and His promises written in the Bible. I realised that He is on my side and I am on His. I have a Heavenly Father who has conquered even death. Why should I fear? After the exercise, I felt a strong a sense of peace upon me.\n As I continued to live out my faith in my daily life, I was reminded by Mary who sat at the feet of Jesus, to always fix my eyes on my Lord. No matter how much life demands of me or what I am facing, all I need to do is to turn to my Lord, spend time with Him in prayer and to listen to Him. As long as I have Jesus with me, I will always have the joy and strength to carry out what is asked of me. He gives me joy till overflowing, so that I can serve with joy, give with joy, carry my crosses with joy and to endure with joy.\n I have come to understand that my encounter with Jesus is not merely for my own good and salvation. It is to inspire and strengthen me to help others encounter the great love that Jesus has for them.\n Go Forth\n Having encountered Jesus several times, I am deeply touched by these experiences. It is beautiful beyond words and how I wish I could remain there with Him in His presence. I can identify with Mary Magdala when she met the Risen Lord at the tomb and wanted to cling onto Him. I too did not want to leave that space, I did not want to leave Jesus’ side.\n But I have come to understand that my encounter with Jesus is not merely for my own good and salvation. It is to inspire and strengthen me to help others encounter the great love that Jesus has for them. As much as I want to stay with Him, I now understand and willingly accept my mission to be sent out as a witness of His love and mercy, to spread the Good News, to do His Holy will in whichever way He asks of me. I am called to be the salt and light of the world so that through my conversion, others can see the true light in Jesus.\n I pray to remain in His merciful love, to persevere in the midst of trials and to be a witness of His love and mercy to those I meet. May I grow in obedience and fidelity to do whatever He asks of me as my little way of thanking Him for the precious gift of faith and life He has given to me.\n.",
    "storyAuthor": "Megan Pham"
  },
  {
    "storyText": "Finding Faith Through Job Loss\n Jason and Jenny first met at a friend’s birthday party in their hometown of Malacca. He was 21 years old, searching for direction in life. She was 16 years old, fresh-faced and full of zest for life. This was the start of their bittersweet life together, one which is now unfolding with Christ.\n Being young and full of dreams, Jason and Jenny moved to Singapore and worked hard at their jobs hoping to carve out a wonderful life together. Jason was a highly skilled machinist in a multinational company dealing with Oil Tools. Jenny was an accountant and also in a multinational company. They took frequent holidays together and ate out regularly in restaurants. To their families, Jason and Jenny seemed like the perfect couple living the perfect dream.\n However the crisis at work began to unravel the empty married life they were living for the past 10 years. In their pursuit of making money, they forgot each other.\n Even though we were living in the same house, our conversations had become very superficial.” recalled Jenny. “We didn’t know what the other person was doing or what was happening in each other’s life.”\n  Jenny pulled long hours at work and even took on additional jobs to make more money. On the other hand, Jason’s shift was from 7am to 4pm. When he left for work early in the morning, Jenny would still be asleep. When Jenny returned from work at midnight, Jason was already fast asleep. The only time they spent together in the week was attending Sunday Mass.\n As the economy started to slow down, manpower changes were made in the company Jason had worked in for the past 18 years. Cheaper foreign labour was brought in and Jason found it increasingly difficult to communicate and work with his co-workers. Frustration and worry mounted as he thought of his financial commitments to the family.\n Meanwhile, Jenny faced her own set of problems at work. A massive restructuring exercise at her company saw Jenny given a bigger portfolio without pay compensation. The 14 hours of work she was putting in daily was leading her to depression.\n Each struggled with their work problems in their own silos. Eventually Jason was given the pink slip in June last year while Jenny decided to call it quits in September the same year. Initially both felt relieved that they no longer had to face the oppressive work environment. But relief soon turned into worry as they saw their bank accounts decrease and bills increase.\n I never thought of giving up.\n  Growing up in a family with deep faith, Jenny turned to God for strength. After a few months of recuperating, she decided to take the leap into direct sales which offered her flexible working hours and an opportunity to better lives through the products she sold. Because of her bubbly personality, she was able to grow her network of business associates and customers quickly and had to travel often for overseas conferences.\n Jason, on the other hand, struggled to find a stable job. He lowered his salary requirements and tried working in different industries but still nothing worked out. Frustrated and lonely, he eventually turned to a common female friend for solace.\n The final blow came when Jenny invited Jason to join her on a trip to Guangzhou and found out that he had planned an overseas trip with this female friend they both knew. Jenny’s world collapsed. In the midst of the pain, both had the grace to desire to salvage their marriage.\n “I never thought of giving up. It never crossed my mind.” Jason said. “We had to beg Fr Bruno for a space in the Marriage Encounter Weekend,” added Jenny as tears flooded her eyes. During the retreat, they pleaded with God to heal their wounded marriage and help them start afresh. They remembered their beginnings and saw how work had overtaken their relationship. It took a crisis to unravel the empty married life they had been living.\n Now, Jason has a full-time job. Even though this job doesn’t pay as much and they have to make drastic changes to their lifestyle, Jason and Jenny are thankful. On top of attending Sunday Mass together, they begin each day renewing their commitment to each other in prayer with God.\n “We are still learning, still recovering and growing in our marriage. Our dream now is to be financially stable so that we can serve in church together.” says Jason as they looked at each other.\n ",
    "storyAuthor": "Daniel Peter"
  },
  {
    "storyText": "My journey through Depression\n “The world gave me many things, but the only thing I ever kept was absolute solitude.”’ Now, don’t get me wrong – there is a difference between isolation and loneliness. As the song goes, ‘Sadness is beautiful, loneliness is tragical.’’ Loneliness as a condition, can be both a curse and a gift, a justification or maybe the doorway to God.\n I have always been an introvert, preferring to escape through the world of books than to spend lots of time mindlessly talking to people. I am not aloof – just that I do not enjoy making small talk. As a student, there is nothing more welcoming than the sound of the last school bell, which indicated that school has ended. Being shy and reserved has its negative effects – somehow, I felt alienated from and ostracized by my classmates.\n The turning point came when I was 19, when my father suddenly passed away from a long battle with cancer. Suddenly, I was forced to grow up quickly without a father-figure beside me. I feared getting involved in a boy-girl relationship (BGR), because I was apprehensive about matters of the heart and honestly, who would walk me down the aisle? I certainly did not want to get hurt. Like a caterpillar in a cocoon, I had deep anxieties and would suffer panic attacks in the night. As a teenager, even though I had argued with my parents and drove them to frustration like any angsty teenager, I still respected my father.\n The first few months was hard, and I did what I would normally do. I was angry, and I also kept my feelings to myself. My so-called “friends” slowly left me one by one, as they could not understand me in this state of depression. While I was depressed, thankfully I have never contemplated suicide or self-harm as I was brought up in the Catholic faith, and it has been imbued in me that Life is a gift from God.\n In today’s society, there are many social taboos – people generally do not talk about death, and there is a perceived stigma that people who are suffering from mental afflictions are weak and not capable of handling the challenges of life. While completing my studies and throughout my job applications, I hid the fact that I had depression, while preferring to keep to myself as I have always been quiet, stoic and uncomfortable in big groups.\n Today, I am still seeing a psychologist to help me through this grey period in my life, and I would still take my medications on a regular basis. The good thing is that I believe in the humane side of psychiatry, and embracing God has helped me become a more cheerful person. I love going for long walks as it helps me get closer to nature. This close proximity with nature in turn cultivates a deep sense of awe for God’s creation, and also serves as a form of meditation for me and helps foster my creativity.\n “Happiness in intelligent people is the rarest thing I know” as quoted by Ernest Hemingway, a famous playwright. We tend to overanalyze because we know what we want and never settle for less than that. Many people with high IQ suffer from psychological problems. Even if they are not suffering from mental health issues, they still have what I would call ‘’existential depression’’. I blame it on the fast-paced society we are living in now. There is often no time for important connection with people.\n As a message of Hope, I would like to end this writing with the quote “Life is a tragedy, but not tragic”. As such, there is no right decision in life. If you decide on something and put your everything into it, it will turn out wonderfully.",
    "storyAuthor": "Daniel Peter"
  },
  {
    "storyText": "It was time for a haircut. Lenny didn't even have to look in the mirror. Even though he was going bald, he knew that he needed to cut his hair every two weeks.\n He had a tongue of hair on the top of his head. His hair was thinning at the crown. He still had plenty of hair on the sides and back. It was what they call salt and pepper, a mixture of gray hair and dark brown hair. It was only a few years, he figured, until the salt and pepper became just salt.\n He never let his hair grow for more than two weeks. The longer it got, the worse it looked, he thought.\n He spread a newspaper over the bathroom sink so that no hair went down the drain. He plugged in the clippers and started cutting his hair. He started at the back of his head, went to the sides, and finished on the top. Every minute or so, he had to clean the hair out of the blades with an old toothbrush. \n Finished, he picked up a hand mirror to check out the back of his head. Everything looked okay. He carried the newspaper back out to the kitchen and shook the hair clippings into the trash can. Then he took a shower.",
    "storyAuthor": "Alan Kay"
  },
  {
    "storyText": "It was time for a haircut. Lenny didn't even have to look in the mirror. Even though he was going bald, he knew that he needed to cut his hair every two weeks.\n He had a tongue of hair on the top of his head. His hair was thinning at the crown. He still had plenty of hair on the sides and back. It was what they call salt and pepper, a mixture of gray hair and dark brown hair. It was only a few years, he figured, until the salt and pepper became just salt.\n He never let his hair grow for more than two weeks. The longer it got, the worse it looked, he thought.\n He spread a newspaper over the bathroom sink so that no hair went down the drain. He plugged in the clippers and started cutting his hair. He started at the back of his head, went to the sides, and finished on the top. Every minute or so, he had to clean the hair out of the blades with an old toothbrush. \n Finished, he picked up a hand mirror to check out the back of his head. Everything looked okay. He carried the newspaper back out to the kitchen and shook the hair clippings into the trash can. Then he took a shower.",
    "storyAuthor": "C.A.R. Hoare"
  },
  {
    "storyText": "It was time for a haircut. Lenny didn't even have to look in the mirror. Even though he was going bald, he knew that he needed to cut his hair every two weeks.\n He had a tongue of hair on the top of his head. His hair was thinning at the crown. He still had plenty of hair on the sides and back. It was what they call salt and pepper, a mixture of gray hair and dark brown hair. It was only a few years, he figured, until the salt and pepper became just salt.\n He never let his hair grow for more than two weeks. The longer it got, the worse it looked, he thought.\n He spread a newspaper over the bathroom sink so that no hair went down the drain. He plugged in the clippers and started cutting his hair. He started at the back of his head, went to the sides, and finished on the top. Every minute or so, he had to clean the hair out of the blades with an old toothbrush. \n Finished, he picked up a hand mirror to check out the back of his head. Everything looked okay. He carried the newspaper back out to the kitchen and shook the hair clippings into the trash can. Then he took a shower.",
    "storyAuthor": "David Thomas"
  },
  {
    "storyText": "It was time for a haircut. Lenny didn't even have to look in the mirror. Even though he was going bald, he knew that he needed to cut his hair every two weeks.\n He had a tongue of hair on the top of his head. His hair was thinning at the crown. He still had plenty of hair on the sides and back. It was what they call salt and pepper, a mixture of gray hair and dark brown hair. It was only a few years, he figured, until the salt and pepper became just salt.\n He never let his hair grow for more than two weeks. The longer it got, the worse it looked, he thought.\n He spread a newspaper over the bathroom sink so that no hair went down the drain. He plugged in the clippers and started cutting his hair. He started at the back of his head, went to the sides, and finished on the top. Every minute or so, he had to clean the hair out of the blades with an old toothbrush. \n Finished, he picked up a hand mirror to check out the back of his head. Everything looked okay. He carried the newspaper back out to the kitchen and shook the hair clippings into the trash can. Then he took a shower.",
    "storyAuthor": "Donald Knuth"
  },
  {
    "storyText": "It was time for a haircut. Lenny didn't even have to look in the mirror. Even though he was going bald, he knew that he needed to cut his hair every two weeks.\n He had a tongue of hair on the top of his head. His hair was thinning at the crown. He still had plenty of hair on the sides and back. It was what they call salt and pepper, a mixture of gray hair and dark brown hair. It was only a few years, he figured, until the salt and pepper became just salt.\n He never let his hair grow for more than two weeks. The longer it got, the worse it looked, he thought.\n He spread a newspaper over the bathroom sink so that no hair went down the drain. He plugged in the clippers and started cutting his hair. He started at the back of his head, went to the sides, and finished on the top. Every minute or so, he had to clean the hair out of the blades with an old toothbrush. \n Finished, he picked up a hand mirror to check out the back of his head. Everything looked okay. He carried the newspaper back out to the kitchen and shook the hair clippings into the trash can. Then he took a shower.",
    "storyAuthor": "Lernantino"
  }
]